import PureRenderMixin from 'react-addons-pure-render-mixin'
import mixin from 'react-mixin'
import ReactDOM from 'react-dom'
import {requestAnimationFrame} from 'core'
import React, {
    Component,
    StyleSheet,
    Text,
    Dimensions,
    ListView,
    View,
    Fetch
} from 'lib'

const {width, height} = Dimensions.get('window');

class Main extends Component {
    static propTypes = {}

    constructor(props, context) {
        super(props, context);
        console.log(props);
        var ds = new ListView.DataSource({rowHasChanged: (r1, r2) => r1 !== r2});
        const rows = BI.keys(props.template.popConfig.widgets);
        this.state = {
            dataSource: ds.cloneWithRows(rows),
        }
    }

    render() {
        return <ListView
            initialListSize={3}
            dataSource={this.state.dataSource}
            renderRow={this._renderRow.bind(this)}
        />
    }

    _renderRow(rowData, sectionID, rowID) {
        const wi = this.props.template.popConfig.widgets[rowData];
        const self = this;
        var data = {
            "data": {
                "s": [11813],
                "c": [{"s": [3], "x": 1, "n": "阿坝藏族羌族自治州"}, {"s": [1], "x": 1, "n": "阿里市"}, {
                    "s": [4],
                    "x": 1,
                    "n": "安康市"
                }, {"s": [5], "x": 1, "n": "安庆市"}, {"s": [3], "x": 1, "n": "安顺市"}, {
                    "s": [7],
                    "x": 1,
                    "n": "安阳市"
                }, {"s": [6], "x": 1, "n": "鞍山市"}, {"s": [4], "x": 1, "n": "澳门"}, {
                    "s": [2],
                    "x": 1,
                    "n": "巴音郭楞市"
                }, {"s": [3], "x": 1, "n": "巴中市"}, {"s": [1], "x": 1, "n": "白城市"}, {
                    "s": [4],
                    "x": 1,
                    "n": "白山市"
                }, {"s": [1], "x": 1, "n": "白银市"}, {"s": [3], "x": 1, "n": "百色市"}, {
                    "s": [6],
                    "x": 1,
                    "n": "蚌埠市"
                }, {"s": [3], "x": 1, "n": "包头市"}, {"s": [22], "x": 1, "n": "保定市"}, {
                    "s": [3],
                    "x": 1,
                    "n": "保山市"
                }, {"s": [11], "x": 1, "n": "宝鸡市"}, {"s": [28], "x": 1, "n": "宝山区"}, {
                    "s": [5],
                    "x": 1,
                    "n": "北海市"
                }, {"s": [152], "x": 1, "n": "北京市区"}, {"s": [2], "x": 1, "n": "本溪市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "毕节地区"
                }, {"s": [8], "x": 1, "n": "滨州市"}, {"s": [4], "x": 1, "n": "亳州市"}, {
                    "s": [20],
                    "x": 1,
                    "n": "沧州市"
                }, {"s": [26], "x": 1, "n": "昌平区"}, {"s": [9], "x": 1, "n": "常德市"}, {
                    "s": [72],
                    "x": 1,
                    "n": "常州市"
                }, {"s": [101], "x": 1, "n": "长春市"}, {"s": [75], "x": 1, "n": "长宁区"}, {
                    "s": [171],
                    "x": 1,
                    "n": "长沙市"
                }, {"s": [9], "x": 1, "n": "长治市"}, {"s": [1], "x": 1, "n": "巢湖市"}, {
                    "s": [366],
                    "x": 1,
                    "n": "朝阳区"
                }, {"s": [4], "x": 1, "n": "朝阳市"}, {"s": [5], "x": 1, "n": "潮州市"}, {
                    "s": [7],
                    "x": 1,
                    "n": "郴州市"
                }, {"s": [413], "x": 1, "n": "成都市"}, {"s": [6], "x": 1, "n": "承德市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "池州市"
                }, {"s": [51], "x": 1, "n": "赤峰市"}, {"s": [3], "x": 1, "n": "崇明县"}, {
                    "s": [3],
                    "x": 1,
                    "n": "崇左市"
                }, {"s": [6], "x": 1, "n": "滁州市"}, {"s": [1], "x": 1, "n": "楚雄彝族自治州"}, {
                    "s": [8],
                    "x": 1,
                    "n": "达州市"
                }, {"s": [10], "x": 1, "n": "大理白族自治州"}, {"s": [182], "x": 1, "n": "大连市"}, {
                    "s": [34],
                    "x": 1,
                    "n": "大庆市"
                }, {"s": [4], "x": 1, "n": "大同市"}, {"s": [1], "x": 1, "n": "大兴安岭地区"}, {
                    "s": [1],
                    "x": 1,
                    "n": "大兴安岭市"
                }, {"s": [27], "x": 1, "n": "大兴区"}, {"s": [4], "x": 1, "n": "丹东市"}, {
                    "s": [11],
                    "x": 1,
                    "n": "德阳市"
                }, {"s": [3], "x": 1, "n": "德州市"}, {"s": [120], "x": 1, "n": "东城区"}, {
                    "s": [93],
                    "x": 1,
                    "n": "东莞市"
                }, {"s": [21], "x": 1, "n": "东营市"}, {"s": [8], "x": 1, "n": "鄂尔多斯市"}, {
                    "s": [4],
                    "x": 1,
                    "n": "鄂州市"
                }, {"s": [2], "x": 1, "n": "恩施土家族苗族自治州"}, {"s": [4], "x": 1, "n": "房山区"}, {
                    "s": [4],
                    "x": 1,
                    "n": "防城港市"
                }, {"s": [61], "x": 1, "n": "丰台区"}, {"s": [6], "x": 1, "n": "奉贤区"}, {
                    "s": [52],
                    "x": 1,
                    "n": "佛山市"
                }, {"s": [155], "x": 1, "n": "福州市"}, {"s": [5], "x": 1, "n": "抚顺市"}, {
                    "s": [2],
                    "x": 1,
                    "n": "抚州市"
                }, {"s": [3], "x": 1, "n": "阜新市"}, {"s": [5], "x": 1, "n": "阜阳市"}, {
                    "s": [3],
                    "x": 1,
                    "n": "甘孜市"
                }, {"s": [11], "x": 1, "n": "赣州市"}, {"s": [1], "x": 1, "n": "固原市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "广安市"
                }, {"s": [1], "x": 1, "n": "广元市"}, {"s": [623], "x": 1, "n": "广州市"}, {
                    "s": [17],
                    "x": 1,
                    "n": "桂林市"
                }, {"s": [4], "x": 1, "n": "贵港市"}, {"s": [45], "x": 1, "n": "贵阳市"}, {
                    "s": [87],
                    "x": 1,
                    "n": "哈尔滨市"
                }, {"s": [2], "x": 1, "n": "哈密市"}, {"s": [2], "x": 1, "n": "海淀区"}, {
                    "s": [852],
                    "x": 1,
                    "n": "海淀区4内"
                }, {"s": [293], "x": 1, "n": "海淀区4外"}, {"s": [1], "x": 1, "n": "海东地区"}, {
                    "s": [39],
                    "x": 1,
                    "n": "海口市"
                }, {"s": [1], "x": 1, "n": "海南藏族自治州"}, {"s": [3], "x": 1, "n": "海西蒙古族藏族自治州"}, {
                    "s": [10],
                    "x": 1,
                    "n": "邯郸市"
                }, {"s": [2], "x": 1, "n": "汉中市"}, {"s": [423], "x": 1, "n": "杭州市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "毫州市"
                }, {"s": [147], "x": 1, "n": "合肥市"}, {"s": [2], "x": 1, "n": "和田市"}, {
                    "s": [5],
                    "x": 1,
                    "n": "河池市"
                }, {"s": [6], "x": 1, "n": "河源市"}, {"s": [6], "x": 1, "n": "菏泽市"}, {
                    "s": [2],
                    "x": 1,
                    "n": "贺州市"
                }, {"s": [4], "x": 1, "n": "鹤壁市"}, {"s": [1], "x": 1, "n": "鹤港市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "黑河市"
                }, {"s": [5], "x": 1, "n": "衡水市"}, {"s": [9], "x": 1, "n": "衡阳市"}, {
                    "s": [4],
                    "x": 1,
                    "n": "红河哈尼族彝族自治州"
                }, {"s": [25], "x": 1, "n": "虹口区"}, {"s": [10], "x": 1, "n": "呼和浩特市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "呼伦贝尔市"
                }, {"s": [16], "x": 1, "n": "湖州市"}, {"s": [7], "x": 1, "n": "葫芦岛市"}, {
                    "s": [6],
                    "x": 1,
                    "n": "怀化市"
                }, {"s": [18], "x": 1, "n": "淮安市"}, {"s": [10], "x": 1, "n": "淮北市"}, {
                    "s": [5],
                    "x": 1,
                    "n": "淮南市"
                }, {"s": [5], "x": 1, "n": "黄冈市"}, {"s": [51], "x": 1, "n": "黄浦区"}, {
                    "s": [3],
                    "x": 1,
                    "n": "黄山市"
                }, {"s": [7], "x": 1, "n": "黄石市"}, {"s": [23], "x": 1, "n": "惠州市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "鸡西市"
                }, {"s": [3], "x": 1, "n": "吉林市"}, {"s": [208], "x": 1, "n": "济南市"}, {
                    "s": [19],
                    "x": 1,
                    "n": "济宁市"
                }, {"s": [3], "x": 1, "n": "济源市"}, {"s": [6], "x": 1, "n": "佳木斯市"}, {
                    "s": [13],
                    "x": 1,
                    "n": "嘉定区"
                }, {"s": [33], "x": 1, "n": "嘉兴市"}, {"s": [2], "x": 1, "n": "嘉峪关市"}, {
                    "s": [20],
                    "x": 1,
                    "n": "江门市"
                }, {"s": [12], "x": 1, "n": "焦作市"}, {"s": [4], "x": 1, "n": "揭阳市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "金昌市"
                }, {"s": [41], "x": 1, "n": "金华市"}, {"s": [4], "x": 1, "n": "金山区"}, {
                    "s": [7],
                    "x": 1,
                    "n": "锦州市"
                }, {"s": [8], "x": 1, "n": "晋城市"}, {"s": [7], "x": 1, "n": "晋中市"}, {
                    "s": [6],
                    "x": 1,
                    "n": "荆门市"
                }, {"s": [14], "x": 1, "n": "荆州市"}, {"s": [3], "x": 1, "n": "景德镇市"}, {
                    "s": [38],
                    "x": 1,
                    "n": "静安区"
                }, {"s": [4], "x": 1, "n": "九江市"}, {"s": [8], "x": 1, "n": "酒泉市"}, {
                    "s": [5],
                    "x": 1,
                    "n": "喀什地区"
                }, {"s": [5], "x": 1, "n": "开封市"}, {"s": [2], "x": 1, "n": "克拉玛依市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "克孜勒苏柯州"
                }, {"s": [92], "x": 1, "n": "昆明市"}, {"s": [2], "x": 1, "n": "来宾市"}, {
                    "s": [2],
                    "x": 1,
                    "n": "莱芜市"
                }, {"s": [66], "x": 1, "n": "兰州市"}, {"s": [23], "x": 1, "n": "廊坊市"}, {
                    "s": [5],
                    "x": 1,
                    "n": "乐山市"
                }, {"s": [3], "x": 1, "n": "丽江市"}, {"s": [6], "x": 1, "n": "丽水市"}, {
                    "s": [13],
                    "x": 1,
                    "n": "连云港市"
                }, {"s": [1], "x": 1, "n": "凉山市"}, {"s": [9], "x": 1, "n": "聊城市"}, {
                    "s": [2],
                    "x": 1,
                    "n": "辽阳市"
                }, {"s": [2], "x": 1, "n": "辽源市"}, {"s": [1], "x": 1, "n": "临沧市"}, {
                    "s": [8],
                    "x": 1,
                    "n": "临汾市"
                }, {"s": [18], "x": 1, "n": "临沂市"}, {"s": [25], "x": 1, "n": "柳州市"}, {
                    "s": [3],
                    "x": 1,
                    "n": "六安市"
                }, {"s": [2], "x": 1, "n": "六盘水市"}, {"s": [4], "x": 1, "n": "龙岩市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "陇南市"
                }, {"s": [4], "x": 1, "n": "娄底市"}, {"s": [17], "x": 1, "n": "泸州市"}, {
                    "s": [15],
                    "x": 1,
                    "n": "洛阳市"
                }, {"s": [4], "x": 1, "n": "漯河市"}, {"s": [7], "x": 1, "n": "吕梁市"}, {
                    "s": [8],
                    "x": 1,
                    "n": "马鞍山市"
                }, {"s": [10], "x": 1, "n": "茂名市"}, {"s": [2], "x": 1, "n": "梅州市"}, {
                    "s": [3],
                    "x": 1,
                    "n": "眉山市"
                }, {"s": [5], "x": 1, "n": "门头沟区"}, {"s": [17], "x": 1, "n": "绵阳市"}, {
                    "s": [40],
                    "x": 1,
                    "n": "闵行区"
                }, {"s": [7], "x": 1, "n": "牡丹江市"}, {"s": [83], "x": 1, "n": "南昌市"}, {
                    "s": [4],
                    "x": 1,
                    "n": "南充市"
                }, {"s": [542], "x": 1, "n": "南京市"}, {"s": [83], "x": 1, "n": "南宁市"}, {
                    "s": [3],
                    "x": 1,
                    "n": "南平市"
                }, {"s": [44], "x": 1, "n": "南通市"}, {"s": [7], "x": 1, "n": "南阳市"}, {
                    "s": [3],
                    "x": 1,
                    "n": "内江市"
                }, {"s": [129], "x": 1, "n": "宁波市"}, {"s": [9], "x": 1, "n": "宁德市"}, {
                    "s": [5],
                    "x": 1,
                    "n": "攀枝花市"
                }, {"s": [14], "x": 1, "n": "盘锦市"}, {"s": [10], "x": 1, "n": "平顶山市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "平谷区"
                }, {"s": [6], "x": 1, "n": "平凉市"}, {"s": [1], "x": 1, "n": "萍乡市"}, {
                    "s": [6],
                    "x": 1,
                    "n": "濮阳市"
                }, {"s": [9], "x": 1, "n": "莆田市"}, {"s": [36], "x": 1, "n": "普陀区"}, {
                    "s": [218],
                    "x": 1,
                    "n": "浦东新区"
                }, {"s": [1], "x": 1, "n": "七台河市"}, {"s": [5], "x": 1, "n": "齐齐哈尔市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "黔东南州"
                }, {"s": [2], "x": 1, "n": "黔南州"}, {"s": [1], "x": 1, "n": "黔西南市"}, {
                    "s": [3],
                    "x": 1,
                    "n": "钦州市"
                }, {"s": [22], "x": 1, "n": "秦皇岛市"}, {"s": [8], "x": 1, "n": "清远市"}, {
                    "s": [116],
                    "x": 1,
                    "n": "青岛市"
                }, {"s": [11], "x": 1, "n": "青浦区"}, {"s": [2], "x": 1, "n": "庆阳市"}, {
                    "s": [8],
                    "x": 1,
                    "n": "衢州市"
                }, {"s": [7], "x": 1, "n": "曲靖市"}, {"s": [43], "x": 1, "n": "泉州市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "日喀则市"
                }, {"s": [15], "x": 1, "n": "日照市"}, {"s": [6], "x": 1, "n": "三门峡市"}, {
                    "s": [5],
                    "x": 1,
                    "n": "三明市"
                }, {"s": [3], "x": 1, "n": "三亚市"}, {"s": [106], "x": 1, "n": "厦门市"}, {
                    "s": [18],
                    "x": 1,
                    "n": "汕头市"
                }, {"s": [3], "x": 1, "n": "汕尾市"}, {"s": [1], "x": 1, "n": "商洛市"}, {
                    "s": [7],
                    "x": 1,
                    "n": "商丘市"
                }, {"s": [376], "x": 1, "n": "上海市区"}, {"s": [2], "x": 1, "n": "上饶市"}, {
                    "s": [6],
                    "x": 1,
                    "n": "韶关市"
                }, {"s": [34], "x": 1, "n": "绍兴市"}, {"s": [4], "x": 1, "n": "邵阳市"}, {
                    "s": [406],
                    "x": 1,
                    "n": "深圳市"
                }, {"s": [3], "x": 1, "n": "神农架市"}, {"s": [119], "x": 1, "n": "沈阳市"}, {
                    "s": [9],
                    "x": 1,
                    "n": "十堰市"
                }, {"s": [3], "x": 1, "n": "石河子市"}, {"s": [86], "x": 1, "n": "石家庄市"}, {
                    "s": [27],
                    "x": 1,
                    "n": "石景山区"
                }, {"s": [3], "x": 1, "n": "石嘴山市"}, {"s": [4], "x": 1, "n": "双鸭山市"}, {
                    "s": [4],
                    "x": 1,
                    "n": "顺义区"
                }, {"s": [3], "x": 1, "n": "朔州市"}, {"s": [1], "x": 1, "n": "思茅市"}, {
                    "s": [3],
                    "x": 1,
                    "n": "四平市"
                }, {"s": [14], "x": 1, "n": "松江区"}, {"s": [3], "x": 1, "n": "松原市"}, {
                    "s": [217],
                    "x": 1,
                    "n": "苏州市"
                }, {"s": [2], "x": 1, "n": "宿迁市"}, {"s": [3], "x": 1, "n": "宿州市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "绥化市"
                }, {"s": [1], "x": 1, "n": "随州市"}, {"s": [4], "x": 1, "n": "遂宁市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "塔城市"
                }, {"s": [10], "x": 1, "n": "台北市"}, {"s": [20], "x": 1, "n": "台州市"}, {
                    "s": [112],
                    "x": 1,
                    "n": "太原市"
                }, {"s": [6], "x": 1, "n": "泰安市"}, {"s": [20], "x": 1, "n": "泰州市"}, {
                    "s": [24],
                    "x": 1,
                    "n": "唐山市"
                }, {"s": [170], "x": 1, "n": "天津市区"}, {"s": [1], "x": 1, "n": "天门市"}, {
                    "s": [7],
                    "x": 1,
                    "n": "天水市"
                }, {"s": [4], "x": 1, "n": "铁岭市"}, {"s": [2], "x": 1, "n": "通化市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "通辽市"
                }, {"s": [11], "x": 1, "n": "通州区"}, {"s": [5], "x": 1, "n": "铜陵市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "铜仁地区"
                }, {"s": [4], "x": 1, "n": "吐鲁番地区"}, {"s": [24], "x": 1, "n": "威海市"}, {
                    "s": [23],
                    "x": 1,
                    "n": "潍坊市"
                }, {"s": [6], "x": 1, "n": "渭南市"}, {"s": [55], "x": 1, "n": "温州市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "文山市"
                }, {"s": [1], "x": 1, "n": "乌海市"}, {"s": [69], "x": 1, "n": "乌鲁木齐"}, {
                    "s": [1],
                    "x": 1,
                    "n": "吴忠市"
                }, {"s": [124], "x": 1, "n": "无锡市"}, {"s": [5], "x": 1, "n": "梧州市"}, {
                    "s": [21],
                    "x": 1,
                    "n": "芜湖市"
                }, {"s": [348], "x": 1, "n": "武汉市"}, {"s": [2], "x": 1, "n": "武威市"}, {
                    "s": [297],
                    "x": 1,
                    "n": "西安市"
                }, {"s": [136], "x": 1, "n": "西城区"}, {"s": [1], "x": 1, "n": "西城区  "}, {
                    "s": [23],
                    "x": 1,
                    "n": "西宁市"
                }, {"s": [2], "x": 1, "n": "锡林郭勒市"}, {"s": [8], "x": 1, "n": "咸宁市"}, {
                    "s": [2],
                    "x": 1,
                    "n": "咸阳市"
                }, {"s": [7], "x": 1, "n": "湘潭市"}, {"s": [2], "x": 1, "n": "湘西市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "湘西土家族苗族自治州"
                }, {"s": [1], "x": 1, "n": "襄樊市"}, {"s": [16], "x": 1, "n": "襄阳市"}, {
                    "s": [5],
                    "x": 1,
                    "n": "香港"
                }, {"s": [9], "x": 1, "n": "孝感市"}, {"s": [5], "x": 1, "n": "忻州市"}, {
                    "s": [7],
                    "x": 1,
                    "n": "新乡市"
                }, {"s": [7], "x": 1, "n": "新余市"}, {"s": [8], "x": 1, "n": "信阳市"}, {
                    "s": [15],
                    "x": 1,
                    "n": "邢台市"
                }, {"s": [1], "x": 1, "n": "兴安市"}, {"s": [136], "x": 1, "n": "徐汇区"}, {
                    "s": [23],
                    "x": 1,
                    "n": "徐州市"
                }, {"s": [10], "x": 1, "n": "许昌市"}, {"s": [2], "x": 1, "n": "宣城市"}, {
                    "s": [3],
                    "x": 1,
                    "n": "雅安市"
                }, {"s": [26], "x": 1, "n": "烟台市"}, {"s": [4], "x": 1, "n": "延安市"}, {
                    "s": [3],
                    "x": 1,
                    "n": "延边朝鲜族自治州"
                }, {"s": [14], "x": 1, "n": "盐城市"}, {"s": [30], "x": 1, "n": "扬州市"}, {
                    "s": [35],
                    "x": 1,
                    "n": "杨浦区"
                }, {"s": [2], "x": 1, "n": "阳江市"}, {"s": [8], "x": 1, "n": "阳泉市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "伊春市"
                }, {"s": [3], "x": 1, "n": "伊犁市"}, {"s": [5], "x": 1, "n": "宜宾市"}, {
                    "s": [11],
                    "x": 1,
                    "n": "宜昌市"
                }, {"s": [10], "x": 1, "n": "宜春市"}, {"s": [2], "x": 1, "n": "益阳市"}, {
                    "s": [36],
                    "x": 1,
                    "n": "银川市"
                }, {"s": [3], "x": 1, "n": "鹰潭市"}, {"s": [2], "x": 1, "n": "营口市"}, {
                    "s": [1],
                    "x": 1,
                    "n": "永州市"
                }, {"s": [11], "x": 1, "n": "榆林市"}, {"s": [8], "x": 1, "n": "玉林市"}, {
                    "s": [9],
                    "x": 1,
                    "n": "玉溪市"
                }, {"s": [9], "x": 1, "n": "岳阳市"}, {"s": [6], "x": 1, "n": "云浮市"}, {
                    "s": [6],
                    "x": 1,
                    "n": "运城市"
                }, {"s": [5], "x": 1, "n": "枣庄市"}, {"s": [47], "x": 1, "n": "闸北区"}, {
                    "s": [11],
                    "x": 1,
                    "n": "湛江市"
                }, {"s": [5], "x": 1, "n": "张家界市"}, {"s": [6], "x": 1, "n": "张家口市"}, {
                    "s": [2],
                    "x": 1,
                    "n": "张掖市"
                }, {"s": [13], "x": 1, "n": "漳州市"}, {"s": [1], "x": 1, "n": "昭通市"}, {
                    "s": [11],
                    "x": 1,
                    "n": "肇庆市"
                }, {"s": [1], "x": 1, "n": "浙江省"}, {"s": [20], "x": 1, "n": "镇江市"}, {
                    "s": [159],
                    "x": 1,
                    "n": "郑州市"
                }, {"s": [41], "x": 1, "n": "中山市"}, {"s": [2], "x": 1, "n": "中卫市"}, {
                    "s": [193],
                    "x": 1,
                    "n": "重庆市区"
                }, {"s": [2], "x": 1, "n": "周口市"}, {"s": [9], "x": 1, "n": "舟山市"}, {
                    "s": [12],
                    "x": 1,
                    "n": "株洲市"
                }, {"s": [62], "x": 1, "n": "珠海市"}, {"s": [4], "x": 1, "n": "驻马店市"}, {
                    "s": [15],
                    "x": 1,
                    "n": "淄博市"
                }, {"s": [3], "x": 1, "n": "资阳市"}, {"s": [5], "x": 1, "n": "自贡市"}, {"s": [9], "x": 1, "n": "遵义市"}],
                "x": 358
            }, "page": [0, 0, 0, 0, 1]
        };
        return <View className={''} ref={function (ob) {
            //BI.requestAsync('fr_bi_dezi', 'widget_setting', wi, (data)=>{

            var w = {...wi, page: -1};
            Fetch(BH.servletURL + '?op=fr_bi_dezi&cmd=widget_setting', {
                method: "POST",

                body: JSON.stringify({widget: w, sessionID: BH.sessionID})
            }).then(function (response) {
                return response.json();// 转换为JSON
            }).then((data)=> {
                let vanCharts = VanCharts.init(ReactDOM.findDOMNode(ob));
                vanCharts.setOptions(Data.Utils.convertDataToChartData(data.data, wi, {
                    click: (d)=> {
                        console.log(d)
                    }
                }))
            });
            //requestAnimationFrame(()=> {

            //})
            //})

        }} key={rowData} style={{height: height / 2}}></View>
    }
}
mixin.onClass(Main, PureRenderMixin);
export default Main
